** ВЫПОЛНИТЬ telega 
доделать модуль експорта чата
сделать модуль експорта текстовых сообщений канала

конфиг
#+begin_src emacs-lisp  :noweb-ref emacs-packages
     (use-package telega
       :commands (telega)
       :bind-keymap 
     	   ("C-c t" . telega-prefix-map)
       :bind (:map telega-chat-mode-map
     	   ("s" . as-org-telega-msg)
     	   ("y" . as-telega-news-copy))
     	  (:map telega-prefix-map
     	      ("g" .(lambda ()
     			(interactive nil 'org-mode)
     		      (telega-browse-url (org-entry-get (point) "url")))

     	       ))
       :init
     	   (setq telega-use-docker t)
     	   (setq telega-emoji-use-images t)
       :config
     	  (setq default-directory "~/Downloads/")
               (setq switch-to-buffer-preserve-window-point nil)  	   
               (setq telega-translate-to-language-by-default "uk")
     	  (require 'telega-adblock) 
     ;          (telega-adblock-mode 1) 
        )

      (defun as-org-telega-msg ()
        (interactive)
        (let ((msg (telega-msg-at (point))))
          (if msg (let*  ((chat (telega-msg-chat msg))
     	    (title (telega-chat-title chat))
     	    (text (progn (telega-msg-copy-text msg) (car kill-ring)))
     	    (link (progn (telega-msg-copy-link msg) (car kill-ring )))
     	    (date (format-time-string "%Y-%m-%d %H:%M" (plist-get msg :date)))
     	    )
     	    (current-kill 2)
     	    (with-current-buffer (get-buffer-create "*my-news*")
     	     (erase-buffer)
     	     (org-mode)
      	     (insert (format "* %s [%s]\n" title date))
     	     (insert (concat text "\n"))
     	     (org-set-property "url" link)
     	     (org-set-property "date" (format "<%s>"date))
     	     (org-set-property "channel" title)
    	     (org-set-property "header" (format "%s [%s]\n" title date))
   	     (write-region nil nil "~/Документы/org/news.org" t)
     	  )

     ))))

     (defun as-telega-news-copy ()
        (interactive)
        (when-let (msg (telega-msg-at (point)))
     	  (let* ((chat (telega-msg-chat msg))
     	      (title (telega-chat-title chat))
     	      (text (progn (telega-msg-copy-text msg) (car kill-ring)))
     	      (date (format-time-string "%Y-%m-%d %H:%M" (plist-get msg :date))))
     	   (current-kill 1)
     	   (when-let (fwrd (plist-get msg :forward_info))
     		(setq date (format-time-string "%Y-%m-%d %H:%M" (plist-get fwrd :date)))
     		(setq title (telega-chat-title
  		(telega-chat-get (plist-get (plist-get fwrd :origin) :chat_id)))))    

  	     (kill-new  (format "%s [%s]\r\n%s"
  		title date (mapconcat 'identity (string-lines text) "\r\n" )))
     	   )))





      (defun as-org-get-news()
       (interactive)
       (org-back-to-heading)
  (kill-new (format "%s\n%s" (org-get-heading) 
         (car (last (split-string (org-get-entry) ":END:"))))))

     		         
     	
      (defun as-telega-news-capture()
       (interactive)
       (telega-msg-copy-link (telega-msg-at (point)))
       (org-capture nil "p")
      )		       
   

#+end_src

#+RESULTS:
: as-telega-news-capture

#+header: :noweb-ref no
установка сервера телега в  docker
#+begin_src bash
  #!/usr/bin/env bash
  docker pull zevlg/telega-server:latest
#+end_src

#+results:
| latest:                              | Pulling                                                                 | from | zevlg/telega-server |    |      |     |                            |
| Digest:                              | sha256:7080229ab6bd547f36edfc63c4a53fac25d2e9a4f8d688e320ab8e7954b29049 |      |                     |    |      |     |                            |
| Status:                              | Image                                                                   | is   | up                  | to | date | for | zevlg/telega-server:latest |
| docker.io/zevlg/telega-server:latest |                                                                         |      |                     |    |      |     |                            |

;; (insert (cdr (prop-match-value (text-property-search-forward ':telega-link))))
экспорт списка каналов telegram
сделать отдельно функцию експорта списка каналов, которой передается список каналов и буфер, куда она будет писать. Сделать опрделение папаметров канала так как делается в информации канала
#+header: :tangle ~/.emacs.d/as-telega-channels-export.el :mkdirp yes :noweb yes 
#+begin_src emacs-lisp
  ;;; as-telega-channels-export.el --- Export all subscribed channels to ORG  

  ;; Copyright (C) 2025 by Andrij Skeptyk.


  ;; telega is free software: you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; (at your option) any later version.

  ;; telega is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ;; GNU General Public License for more details.

  ;; You should have received a copy of the GNU General Public License
  ;; along with telega.  If not, see <http://www.gnu.org/licenses/>.


  (require 'telega)

  (defun as-telega-channel-export (chat)
    "Return org item for the CHAT.
  CHAT must be a public channel or supergroup."
    (let* ((username (telega-chat-username chat))
           (url  (concat (or (plist-get telega--options :t_me_url)
                                 "https://t.me/")
                             username))
           (title (substring-no-properties (or (telega-chat-title chat) "")))
           (link (format "[[%s][%s]]" url title))
           (description (substring-no-properties
                         (or (telega-tl-str (telega--full-info
                                             (telega-chat--info chat))
                                            :description)
                             ""))))
       (format "* %s\n:PROPERTIES:\n:title: %s\n:url: %s\n:link: %s\n:END:\n:DESCRIPTION:\n%s\n:END:\n"
  	   title  title url link description)))

  ;;;###autoload
  (defun as-telega-channels-export (filename)
    "Export all telegam channels to org"
    (interactive "FExport channels into org file: ")

    (let* ((filter '(and (type channel) has-username))
           (chats (telega-filter-chats telega--filtered-chats filter))
           (export-list (mapcar #'as-telega-channel-export chats)))
      (with-temp-file filename
        (mapc (lambda (item) (insert item)) export-list)
        )))
;;      (message "%d channels exported into %s" (length chats) filename)))

  (provide 'as-telega-channels-export)

  ;;; telega-channels-export.el ends here

#+end_src

#+RESULTS:
: as-telega-channels-export

